Revit 2026 API

# ReferencePlaneDirection Property

---

The direction of the reference plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Direction { get; set; }
```
```vb
Public Property Direction As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Direction {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Direction : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| ArgumentOutOfRangeException | When setting this property: newDir has zero length. |

When setting this property, an exception will be thrown if the direction vector is not perpendicular to the normal vector.

#### Reference

ReferencePlane Class

Autodesk.Revit.DB Namespace